# Задание №8
# 📌 Нарисовать в консоли ёлку спросив
#    у пользователя количество рядов.

# 📌Пример результата:
# Сколько рядов у ёлки? 5
#     *
#    ***
#   *****
#  *******
# *********


spruce_rows = int(input('Задайте количество рядов елки: '))

for i in range(1, spruce_rows*2, 2):
    for _ in range(((spruce_rows*2)-i)//2):
        print(' ', end='')
    for _ in range(i):
        print('*', end='')
    print('')